Revit 2026 API

# UnitSystem Enumeration

---

A system of measurement: Metric or Imperial units.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum UnitSystem
```
```vb
Public Enumeration UnitSystem
```
```cpp
public enum class UnitSystem
```
```fsharp
type UnitSystem
```

| Member name | Value | Description |
| --- | --- | --- |
| Imperial | 1 | Imperial units. |
| Metric | 0 | Metric units. |

#### Reference

Autodesk.Revit.DB Namespace